
#include <USB_struct.h>

/**************************************************************************************************
                                    ПРОТОТИПЫ ЛОКАЛЬНЫХ ФУНКЦИЙ
**************************************************************************************************/

__IO uint8_t Receive_Buffer[64];
__IO uint8_t Receive_length;
__IO uint8_t Send_Buffer[VIRTUAL_COM_PORT_DATA_SIZE] ;
__IO uint8_t Send_length;


/**************************************************************************************************
                                       ГЛОБАЛЬНЫЕ ПЕРЕМЕННЫЕ
**************************************************************************************************/

usb_struct Usb1 =
{
	.rxBuf			= Receive_Buffer,
	.rxCounter	= &Receive_length,
	.rxTail			=	0,
	.rxHead			=	0,
	.txBufPtr		= Send_Buffer,
	.txCounter	=	&Send_length,
};

/**************************************************************************************************
                                        ГЛОБАЛЬНЫЕ ФУНКЦИИ
**************************************************************************************************/

/**************************************************************************************************
Описание:  Возвращает очередной байт из буфера приемника UART
Аргументы: Указатель на структуру UART
Возврат:   Байт данных
Замечания: Изменяет счетчик принятых байт 
**************************************************************************************************/
uint8_t GetByteFromUsb( usb_struct * usb )
{
	uint8_t dataByte;

	dataByte = usb->rxBuf[ usb->rxTail ]; 
	usb->rxTail++;
	usb->rxTail %= RX_BUFFER_SIZE;
		
	ENTER_CRITICAL_SECTION();
	
		usb->rxCounter--;
		
	LEAVE_CRITICAL_SECTION();	
		
	return dataByte; 	
}



/**************************************************************************************************
Описание:  Возвращает состояние буфера приемника
Аргументы: Указатель на структуру UART
Возврат:   true, если есть необработанные байты
Замечания: 
**************************************************************************************************/
bool IsNewDataInUsb( usb_struct * usb )
{
	if ( usb->rxCounter )
	{
		return true;
	}
	else
	{
		return false;
	}
}



/**************************************************************************************************
Описание:  Инициализация процесса отправки сообщения по UART
Аргументы: Указатель на структуру UART, указатель на буффер, длина
Возврат:   Нет
Замечания: 
**************************************************************************************************/
void SendDataToUsb( usb_struct * usb, uint8_t *buffer, uint16_t size )
{
	usb->txBufPtr = buffer;
	*(usb->txCounter) = size - 1;
	CDC_Send_DATA ((uint8_t *)usb->txBufPtr, (uint32_t)usb->txCounter);
}



/**************************************************************************************************
                                       ЛОКАЛЬНЫЕ ФУНКЦИИ
**************************************************************************************************/


