/**************************************************************************************************
 TIMER_SERVICE.C

 Служба времени
   
**************************************************************************************************/

#include <time_service.h>


/**************************************************************************************************
                                       ГЛОБАЛЬНЫЕ ПЕРЕМЕННЫЕ
**************************************************************************************************/

static volatile system_time SystemTime;



/**************************************************************************************************
                                        ГЛОБАЛЬНЫЕ ФУНКЦИИ
**************************************************************************************************/

/**************************************************************************************************
Описание:  Инициализация службы времени
Аргументы: Указатель на функцию-обработчик ошибок инициализации
Возврат:   Нет
Замечания: 
**************************************************************************************************/
void InitTimeService(void)
{
	SystemTime = 0;

	if (SysTick_Config(SystemCoreClock / 1000))
	{ 
		FAIL_ASSERT();
	}
}



/**************************************************************************************************
Описание:  Обработчик прерываний от системного таймера
Аргументы: Нет
Возврат:   Нет
Замечания: 
**************************************************************************************************/
void SysTick_Handler(void)
{
	SystemTime++;
}



/**************************************************************************************************
Описание:  Возвращает текущее время
Аргументы: Нет
Возврат:   Время в миллисекундах
Замечания: 
**************************************************************************************************/
system_time GetSystemTime(void)
{
	return SystemTime;
}



/**************************************************************************************************
Описание:  Обеспечивает задержку
Аргументы: Время задержки в тиках службы времени
Возврат:   Нет
Замечания: 
**************************************************************************************************/
void Delay(system_time delayTime)
{
	system_time time = GetSystemTime();
	while((system_time)(GetSystemTime() - time) < delayTime)
	{
		continue;
	}
}
