
#ifndef __ADC__

#define __ADC__


#include <stm32f10x.h>
#include <stm32f10x_conf.h>


/************************************************************************************
 * ******************************Настройки*******************************************
 ***********************************************************************************/
#define ADC_1
	#define ADC1_REGS							ADC1

	#define ADC1_USING_CHAN				4														//	используемые каналы

	#define ADC1_PIN							GPIO_Pin_4									//	задействованные выводы
	#define ADC1_PORT							GPIOA												//	порты соответствующие выводам

	#define ADC1_CONT_CONV_MODE		ENABLE											//	непрерывные преобразования
	#define ADC1_ALIGN						ADC_DataAlign_Right					//	выравнивание справа
	#define ADC1_EXT_TRIG_CONV		ADC_ExternalTrigConv_None		//	триггер выключим

	#define ADC1_MODE							ADC_Mode_Independent
	#define ADC1_SCAN_MODE				ENABLE
	#define ADC1_SAMP_TIME				ADC_SampleTime_239Cycles5
	#define ADC1_DMA							ENABLE											//	задействуется DMA



//*********************структура данных для инициализации АЦП************************

typedef struct
{
	ADC_TypeDef 					*regs;

	uint8_t								usingChannel;		//	используемые каналы

	uint16_t 							pin;
	GPIO_TypeDef 					*port;

	FunctionalState 			contConvMode;			//	задает режим преобразований, однократное или непрерывное
	uint32_t 							dataAlign;				//	выравнивание справа или слева
	uint32_t 							extTrigConv;			//	срабатывание по внешнему событию
	uint32_t							mode;							//	режим работы одиночный, независимый
	FunctionalState 			scanConvMode;			//	режим сканирования каналов вкл/выкл
	uint8_t 							sampleTime;				//	количество тактов на преобразование
	uint8_t 							dma;							//	задействовано DMA или нет
} ADC_struct;

//***********************************************************************************


/**************************************************************************************************
                                         объявление глобальных переменных
**************************************************************************************************/
#ifdef ADC_1
	extern ADC_struct ADC1_;
#endif

/**************************************************************************************************
                                   ПРОТОТИПЫ ГЛОБАЛЬНЫХ ФУНКЦИЙ
**************************************************************************************************/

void InitAdc(ADC_struct * adc);

#endif	/*	__ADC__	*/

