
#include <self_control.h>

//static void sleepSwitcher( void );


enum self_control_states
{
	START_TIMER,
	WAIT_FOR_TIMER,
	EXECUTE
} SelfControlState;



/**************************************************************************************************
Описание:  Инициализация конечного автомата модуля самоконтроля
Аргументы: нет
Возврат:   нет
Замечания: 
**************************************************************************************************/
void InitSelfControlFsm( void )
{
	SelfControlState = START_TIMER;
}



/**************************************************************************************************
Описание:  Реализация конечного автомата модуля самоконтроля
Аргументы: нет
Возврат:   нет
Замечания: 
**************************************************************************************************/
void SelfControlFsm( void )
{	
	/*if ( MG_IsRegChanged(MG_REG_RW_RESET))
	{
		while(1)
		{}
	}*/
}

/**************************************************************************************************
Описание:  Инициализация сторожевого таймера
Аргументы: Нет
Возврат:   Нет
Замечания: 
**************************************************************************************************/
void InitIwdg( void )
{
	/*IWDG_WriteAccessCmd(IWDG_WriteAccess_Enable);

	// Настройка на время T (c):
	// LSI = 40000 (Гц)
	// reload = LSI * T / prescaler
	// Для 250мс: prescaler = 32; reload = 313
	IWDG_SetPrescaler( IWDG_Prescaler_32 );
	IWDG_SetReload( 500 );
    
	IWDG_ReloadCounter();
	IWDG_Enable();*/
}


