/**************************************************************************************************
 MG_COMMON.C

 Общие функции MilliGanjubus

**************************************************************************************************/

#include <mg_common.h>



/**************************************************************************************************
                                    ПРОТОТИПЫ ЛОКАЛЬНЫХ ФУНКЦИЙ
**************************************************************************************************/
mg_reg_addr getRegAdrDummy(mg_reg_addr slaveReg, uint8_t devAdr);



/**************************************************************************************************
                                        ГЛОБАЛЬНЫЕ ФУНКЦИИ
**************************************************************************************************/

/**************************************************************************************************
Описание:  Инициализация структуры входящих сообщений
Аргументы: Указатель на структуру
Возврат:   Нет
Замечания:
**************************************************************************************************/
void MG_InitInputStruct(mg_input * msg, uint8_t ackCode)
{
	msg->jointSize = 0;
	msg->stuff = &msg->joint[MG_OFFSET_STUFF];
	msg->stuffSize = 0;
	msg->counter = 0;
	StartSoftTimer(&msg->timer, MG_MAX_RECEIVE_DELAY);
	msg->devAdr = 0;
	msg->expectedAckCode = ackCode;
	msg->getRegAdr = getRegAdrDummy;
}



/**************************************************************************************************
Описание:  Инициализация структуры исходящих сообщений
Аргументы: Указатель на структуру
Возврат:   Нет
Замечания:
**************************************************************************************************/
void MG_InitOutputStruct(mg_output * msg)
{
	msg->jointSize = 0;
	msg->stuff = &msg->joint[MG_OFFSET_STUFF];
	msg->stuffSize = 0;
	msg->devAdr = 0;
}



/**************************************************************************************************
Описание:  Инициализация сборки запроса на запись
Аргументы: Указатель на структуру исходящих сообщений, адрес слэйва
Возврат:   Нет
Замечания:
**************************************************************************************************/
void MG_StartWriteReq(mg_output * outMsg, uint8_t devAdr)
{
	outMsg->devAdr = devAdr;
	outMsg->stuff[0] = G_MakeGbyte(G_FCODE_WRITE_REGS_SERIES, G_REQ);
	outMsg->stuffSize = 1;
}



/**************************************************************************************************
Описание:  Добавление регистра в запрос на запись
Аргументы: Указатель на структуру исходящих сообщений, адрес регистра, значение
Возврат:   Нет
Замечания:
**************************************************************************************************/
void MG_AddRegToWriteReq(mg_output * outMsg, mg_reg_addr adr, mg_reg_value value)
{
	outMsg->stuff[outMsg->stuffSize] = adr;
	outMsg->stuff[outMsg->stuffSize + 1] = value;
	outMsg->stuffSize += 2;
}



/**************************************************************************************************
Описание:  Проверка запроса на запись на предмет заполнения до разрешенного максимума
Аргументы: Указатель на структуру исходящих сообщений
Возврат:   True, если запрос полон
Замечания:
**************************************************************************************************/
bool MG_IsWriteReqFull(mg_output * outMsg)
{
	return ((outMsg->stuffSize - 1) / 2 >= MG_MAX_REGS_IN_SERIES);
}



/**************************************************************************************************
Описание:  Инициализация сборки запроса на чтение
Аргументы: Указатель на структуру исходящих сообщений, адрес слэйва
Возврат:   Нет
Замечания:
**************************************************************************************************/
void MG_StartReadReq(mg_output * outMsg, uint8_t devAdr)
{
	outMsg->devAdr = devAdr;
	outMsg->stuff[0] = G_MakeGbyte(G_FCODE_READ_REGS_SERIES, G_REQ);
	outMsg->stuffSize = 1;
}



/**************************************************************************************************
Описание:  Добавление регистра в запрос на чтение
Аргументы: Указатель на структуру исходящих сообщений, адрес регистра
Возврат:   Нет
Замечания:
**************************************************************************************************/
void MG_AddRegToReadReq(mg_output * outMsg, mg_reg_addr adr)
{
	outMsg->stuff[outMsg->stuffSize] = adr;
	outMsg->stuffSize++;
}



/**************************************************************************************************
Описание:  Проверка запроса на чтение на предмет заполнения до разрешенного максимума
Аргументы: Указатель на структуру исходящих сообщений
Возврат:   True, если запрос полон
Замечания:
**************************************************************************************************/
bool MG_IsReadReqFull(mg_output * outMsg)
{
	return ((outMsg->stuffSize - 1) >= MG_MAX_REGS_IN_SERIES);
}



/**************************************************************************************************
Описание:  Инициализация структуры входящих сообщений
Аргументы: Указатель на структуру
Возврат:   Нет
Замечания:
**************************************************************************************************/
void MG_SetRegRemapFunc(mg_input * msg, mg_reg_addr (*getRegAdr)(mg_reg_addr slaveReg, uint8_t devAdr))
{
	msg->getRegAdr = getRegAdr;
}



/**************************************************************************************************
Описание:  Установка адреса устройства в структуре входящих сообщений
Аргументы: Указатель на структуру
Возврат:   Нет
Замечания:
**************************************************************************************************/
void MG_SetInputDevAdr(mg_input * msg, uint8_t devAdr)
{
	msg->devAdr = devAdr;
}



/**************************************************************************************************
Описание:  Установка адреса устройства в структуре исходящих сообщений
Аргументы: Указатель на структуру
Возврат:   Нет
Замечания:
**************************************************************************************************/
void MG_SetOutputDevAdr(mg_output * msg, uint8_t devAdr)
{
	msg->devAdr = devAdr;
}



/**************************************************************************************************
Описание:  Возвращает адрес устройства в структуре исходящих сообщений
Аргументы: Указатель на структуру
Возврат:   Адрес устройства
Замечания:
**************************************************************************************************/
uint8_t MG_GetOutputDevAdr(mg_output * msg)
{
	return msg->devAdr;
}



/**************************************************************************************************
Описание:  Возвращает указатель на буфер структуры исходящих сообщений
Аргументы: Указатель на структуру
Возврат:   Указатель на буфер
Замечания:
**************************************************************************************************/
uint8_t * MG_GetOutBufPtr(mg_output * msg)
{
	return msg->joint;
}



/**************************************************************************************************
Описание:  Возвращает размер буфера структуры исходящих сообщений
Аргументы: Указатель на структуру
Возврат:   Размер буфера
Замечания:
**************************************************************************************************/
uint8_t MG_GetOutBufSize(mg_output * msg)
{
	return msg->jointSize;
}


/**************************************************************************************************
                                       ЛОКАЛЬНЫЕ ФУНКЦИИ
**************************************************************************************************/

/**************************************************************************************************
Описание:  Заглушка: возвращает адрес мастер-регистра по адресу слэйв-регистра и адресу слэйва
Аргументы: Слэйв-регистр, адрес устройства
Возврат:   Мастер-регистр
Замечания:
**************************************************************************************************/
mg_reg_addr getRegAdrDummy(mg_reg_addr slaveReg, uint8_t devAdr)
{
	return MG_REG_NULL;
}
