/**************************************************************************************************
 MG_REGS.H

 Заголовочный файл модуля работы с регистрами

**************************************************************************************************/
#ifndef __MG_REGS__

#define __MG_REGS__


#include <stdint.h>
#include <stdbool.h>
#include <stm32f10x.h>
#include <mg_reg_names.h>



/**************************************************************************************************
                                             ТИПЫ ДАННЫХ
**************************************************************************************************/

typedef uint8_t mg_reg_value;
typedef uint8_t mg_reg_addr;



/**************************************************************************************************
                                   ПРОТОТИПЫ ГЛОБАЛЬНЫХ ФУНКЦИЙ
**************************************************************************************************/

mg_reg_value MG_GetReg(mg_reg_addr reg);
void MG_SetReg(mg_reg_addr reg, mg_reg_value value);
bool MG_IsRegChanged(mg_reg_addr reg);
bool MG_IsRegValid(mg_reg_addr reg);
bool MG_IsRegTypeR(mg_reg_addr reg);
bool MG_IsRegTypeW(mg_reg_addr reg);

#endif		/* __MG_REGS__ */
